import React, { useState } from "react";
import { Link } from "react-router-dom";
import "../styles/home.css";

const effectStyles = {
    "Швидкість": { color: "#00BFFF" },
    "Сила": { color: "red" },
    "Відновлення": { color: "limegreen" },
    "Нічне бачення": { color: "#0022ff" },
    "Невидимість": { color: "#555" },
    "Вогнестійкість": { color: "#FF8C00" },
    "Водне дихання": { color: "#1E90FF" },
    "Стрибучість": { color: "#3be10d" },
    "Повільне падіння": { color: "#A0522D" },
    "Слабкість": { color: "#808080" },
    "Отруєння": { color: "darkgreen" },
    "Шкода": { color: "#8B0000" },
    "Стійкість та Повільність": { color: "#556B2F" },
};


const potionsData = [
    {
        id: 1,
        name: "Зілля швидкості",
        effect: "Швидкість",
        steps: [
            "Заповніть пляшечки водою.",
            "Додайте Незерський наріст для отримання Незавершеного зілля.",
            "Додайте Цукор для створення Зілля швидкості.",
            "Опціонально: додайте Червоний камінь для подовження тривалості.",
        ],
        ingredients: ["Пляшечка води", "Незерський наріст", "Цукор", "Червоний камінь (опціонально)"],
    },
    {
        id: 2,
        name: "Зілля сили",
        effect: "Сила",
        steps: [
            "Заповніть пляшечки водою.",
            "Додайте Незерський наріст для отримання Незавершеного зілля.",
            "Додайте Порошок Іфріта для створення Зілля сили.",
            "Опціонально: додайте Червоний камінь для подовження тривалості.",
        ],
        ingredients: ["Пляшечка води", "Незерський наріст", "Порошок Іфріта", "Червоний камінь (опціонально)"],
    },
    {
        id: 3,
        name: "Зілля регенерації",
        effect: "Відновлення",
        steps: [
            "Заповніть пляшечки водою.",
            "Додайте Незерський наріст для отримання Незавершеного зілля.",
            "Додайте Сльозу Ґаста для створення Зілля регенерації.",
            "Опціонально: додайте Червоний камінь для подовження тривалості.",
        ],
        ingredients: ["Пляшечка води", "Незерський наріст", "Сльоза Ґаста", "Червоний камінь (опціонально)"],
    },
    {
        id: 4,
        name: "Зілля нічного бачення",
        effect: "Нічне бачення",
        steps: [
            "Заповніть пляшечки водою.",
            "Додайте Незерський наріст для отримання Незавершеного зілля.",
            "Додайте Золоту моркву для створення Зілля нічного бачення.",
            "Опціонально: додайте Червоний камінь для подовження тривалості.",
        ],
        ingredients: ["Пляшечка води", "Незерський наріст", "Золота морква", "Червоний камінь (опціонально)"],
    },
    {
        id: 5,
        name: "Зілля невидимості",
        effect: "Невидимість",
        steps: [
            "Приготуйте Зілля нічного бачення.",
            "Додайте Зброджене павуче око для перетворення на Зілля невидимості.",
            "Опціонально: додайте Червоний камінь для подовження тривалості.",
        ],
        ingredients: ["Зілля нічного бачення", "Зброджене павуче око", "Червоний камінь (опціонально)"],
    },
    {
        id: 6,
        name: "Зілля вогнестійкості",
        effect: "Вогнестійкість",
        steps: [
            "Заповніть пляшечки водою.",
            "Додайте Незерський наріст для отримання Незавершеного зілля.",
            "Додайте Кремезний крем для створення Зілля вогнестійкості.",
            "Опціонально: додайте Червоний камінь для подовження тривалості.",
        ],
        ingredients: ["Пляшечка води", "Незерський наріст", "Кремезний крем", "Червоний камінь (опціонально)"],
    },
    {
        id: 7,
        name: "Зілля водного дихання",
        effect: "Водне дихання",
        steps: [
            "Заповніть пляшечки водою.",
            "Додайте Незерський наріст для отримання Незавершеного зілля.",
            "Додайте Рибу-сферу для створення Зілля водного дихання.",
            "Опціонально: додайте Червоний камінь для подовження тривалості.",
        ],
        ingredients: ["Пляшечка води", "Незерський наріст", "Риба-сфера", "Червоний камінь (опціонально)"],
    },
    {
        id: 8,
        name: "Зілля стрибучості",
        effect: "Стрибучість",
        steps: [
            "Заповніть пляшечки водою.",
            "Додайте Незерський наріст для отримання Незавершеного зілля.",
            "Додайте Кролячу лапку для створення Зілля стрибучості.",
            "Опціонально: додайте Червоний камінь для подовження тривалості.",
        ],
        ingredients: ["Пляшечка води", "Незерський наріст", "Кроляча лапка", "Червоний камінь (опціонально)"],
    },
    {
        id: 9,
        name: "Зілля повільного падіння",
        effect: "Повільне падіння",
        steps: [
            "Заповніть пляшечки водою.",
            "Додайте Незерський наріст для отримання Незавершеного зілля.",
            "Додайте Мембрану фантома для створення Зілля повільного падіння.",
            "Опціонально: додайте Червоний камінь для подовження тривалості.",
        ],
        ingredients: ["Пляшечка води", "Незерський наріст", "Мембрана фантома", "Червоний камінь (опціонально)"],
    },
    {
        id: 10,
        name: "Зілля слабкості",
        effect: "Слабкість",
        steps: [
            "Заповніть пляшечки водою.",
            "Додайте Зброджене павуче око для створення Зілля слабкості.",
            "Опціонально: додайте Червоний камінь для подовження тривалості.",
        ],
        ingredients: ["Пляшечка води", "Зброджене павуче око", "Червоний камінь (опціонально)"],
    },
    {
        id: 11,
        name: "Зілля отрути",
        effect: "Отруєння",
        steps: [
            "Заповніть пляшечки водою.",
            "Додайте Незерський наріст для отримання Незавершеного зілля.",
            "Додайте Павуче око для створення Зілля отрути.",
            "Опціонально: додайте Червоний камінь для подовження тривалості.",
        ],
        ingredients: ["Пляшечка води", "Незерський наріст", "Павуче око", "Червоний камінь (опціонально)"],
    },
    {
        id: 12,
        name: "Зілля шкоди",
        effect: "Шкода",
        steps: [
            "Приготуйте Зілля отрути або Зілля відновлення.",
            "Додайте Зброджене павуче око для перетворення на Зілля шкоди.",
        ],
        ingredients: ["Зілля отрути або Зілля відновлення", "Зброджене павуче око"],
    },
    {
        id: 13,
        name: "Зілля майстра черепах",
        effect: "Стійкість та Повільність",
        steps: [
            "Заповніть пляшечки водою.",
            "Додайте Незерський наріст для отримання Незавершеного зілля.",
            "Додайте Черепашачий панцир для створення Зілля майстра черепах.",
            "Опціонально: додайте Червоний камінь для подовження тривалості.",
        ],
        ingredients: ["Пляшечка води", "Незерський наріст", "Черепашачий панцир", "Червоний камінь (опціонально)"],
    },
];


const Home = () => {

    const [selectedPotion, setSelectedPotion] = useState(null);
    const [currentStep, setCurrentStep] = useState(0);


    const handlePotionSelect = (potion) => {
        setSelectedPotion(potion);
        setCurrentStep(0);
    };

    const nextStep = () => {
        if (currentStep < selectedPotion.steps.length - 1) {
            setCurrentStep(currentStep + 1);
        }
    };

    const prevStep = () => {
        if (currentStep > 0) {
            setCurrentStep(currentStep - 1);
        }
    };

    return (
        <div className="content">
            {/* Верхня панель */}
            <div className="button-container">
                <img src={"/assets/images/pngwing.com (1).png"} className="bytpuck" alt="Logo" />
                <div className="main_menu">
                    <Link to="/set-spawn" className="scale" style={{ marginLeft: "20px" }}>
                        Встановити спавнпоінт
                    </Link>
                    <Link to="/potion-recipe" className="scale">
                        Отримати рецепт зілля
                    </Link>
                    <Link to="/spawn-location" className="scale">
                        Дізнатися де спавнпоінт
                    </Link>
                    <Link to="/shop" className="scale">
                        Наявні зілля
                    </Link>
                </div>
                <img src={"/assets/images/pngwing.com (1).png"} className="bytpuck" alt="Logo" style={{ marginLeft: "20px" }} />
            </div>

            {/* Заголовок і картинка */}
            <div className="flexbox" style={{ backgroundSize: "0%" }}>
                <div>
                    <h1 style={{
                        fontSize: "70px",
                        maxWidth: "600px",
                        marginLeft: "150px",
                        marginTop: "50px",
                        textAlign: "left",
                        border: "solid white"
                    }}>Отримати рецепт зілля</h1>
                    <img src={"/assets/images/recipes.jpg"} className="bytpuck" alt="Potion"
                         style={{
                             width: '750px',
                             height: '400px',
                             marginTop: '-250px',
                             marginLeft: '500px',
                             borderRadius: "20px"
                         }} />
                </div>
            </div>

            {/* 🔽 Доданий блок з вибором зілля */}
            <div className="box1" style={{ textAlign: "left"  , marginTop: "-380px"  , marginLeft: "-1300px" }}>
                <div className={"mid_text"}>
                    <h2 >Оберіть зілля для рецепту</h2>
                    <select style={{ marginTop: "0px"}} onChange={(e) => handlePotionSelect(potionsData.find(p => p.id === parseInt(e.target.value)))}>
                        <option value="">-- Виберіть зілля --</option>
                        {potionsData.map(potion => (
                            <option key={potion.id} value={potion.id}>{potion.name}</option>
                        ))}
                    </select>

                    {selectedPotion && (
                        <div style={{ marginTop: "-20px" , paddingBottom: "100px"}}>
                            <h3>{selectedPotion.name}</h3>
                            <p>
                                <strong>Ефект:</strong>{" "}
                                <span style={effectStyles[selectedPotion.effect] || {color: "black"}}>
                                   {selectedPotion.effect}
                                </span>
                            </p>

                            <h4>Інгредієнти:</h4>
                            <ul>
                                {selectedPotion.ingredients.map((ingredient, index) => (
                                    <li key={index}>{ingredient}</li>
                                ))}
                            </ul>
                            <h4>Крок {currentStep + 1} з {selectedPotion.steps.length}:</h4>
                            <p>{selectedPotion.steps[currentStep]}</p>
                            <div style={{ marginTop: "10px" }}>
                                <button onClick={prevStep} disabled={currentStep === 0}>Назад</button>
                                <button onClick={nextStep} disabled={currentStep === selectedPotion.steps.length - 1}>Далі</button>
                            </div>
                        </div>
                    )}
                </div>
            </div>
        </div>
    );
};

export default Home;
